[
  {
    "review": "Thank you so much for the incredible flowers!!! Everything was amazing but have to admit when I walked down the aisle and saw the archway they looked absolutely stunning (They kept catching my eye during the night) Thanks also for bracing the weather yesterday, I know it wasn’t an awesome day to be out and about.",
    "name": "Emma W.",
    "wedding": true
  },
  {
    "review": "Thank you so much for the bouquets and buttonholes you did they were spectacular, I loved them, they looked amazing! We were so happy with how everything turned out, it was a perfect day. ",
    "name": "Sophie. (Bride)",
    "wedding": true
  },
  {
    "review": "Thanks again for the beautiful flowers. They were amazing",
    "name": "Racel. (Bride)",
    "wedding": true
  },
  {
    "review": "Annwyn, the flowers were spectacular, we got so many compliments and the guests thought they were simply stunning. \nI too cannot agree more, to describe the hangings as beautiful is an understatement. The flowers really pulled the entire wedding design together and made it very special for us, so thank you very much. Your work really made the Wedding special for us and knowing that we have the dried flowers for years to come as a reminder is really special too.\n",
    "name": "Martina. (Bride)",
    "wedding": true
  },
  {
    "review": "I just wanted to say a huge thank you for Friday I adored them so much! Everyone was in awe of what you created! Shayne and his team were obsessed with all the stunning details and the Arch stayed up all of Saturday and one of the staff told me that there were so many photos taken and comments made of on how beautiful it was!",
    "name": "Maddie. (Bride)",
    "wedding": true
  },
  {
    "review": "We had an amazing time. Everyone commented on the beautiful flowers.",
    "name": "Jess. (Bride)",
    "wedding": true
  },
  {
    "review": "Thanks for your amazing work and bringing our vision to life.",
    "name": "Phoebe S. (Bride)",
    "wedding": true
  },
  {
    "review": "AMAZING and beautiful dried flowers for my Daughter's wedding. Annwyn has a wonderful talent of listening to people's ideas and bringing them to life. The flowers were truly beautiful, I loved them all but the bike wheel was the next level, the flowers in the beer cans so unique and well, the bouquet matched the vintage wedding dress perfectly. Thank you so much.",
    "name": "Corrina S. (Mother of the Bride)",
    "wedding": true
  },
  {
    "review": "Thank you so much for the beautiful, thoughtfully selected floral bouquet delivered to my daughter today. She said they smelt devine and that there was such a vast variety of blooms, so pretty and cheerful. They lifted her spirits during a difficult time. It made her feel like family were not so far away. We can't thank you enough.",
    "name": "Jen E.",
    "wedding": false
  },
  {
    "review": "Annwyn produced the most stunning bouquet which brought much joy to a lady who sorely needed cheering. Annwyn puts so much love into her work. We were truly delighted. Roger and Hannelore. The Cotswolds, England\n",
    "name": "Roger P.",
    "wedding": false
  },
  {
    "review": "I don't live locally so have never seen Floriade's work in person, so ordering 'blind' from out of town can sometimes be a gamble. Not with these guys! Incredible, swift service and Annwyn sent out the most beautiful bouquet that both sender and sendee love. Couldn't ask for more. Will 100% look for any excuse to send a Floriade bouquet to more friends and family in future!",
    "name": "Steph.",
    "wedding": false
  },
  {
    "review": "Ordered flowers on line from Ireland, great communication, great service, beautiful flowers. You can't get better than that, can't wait to visit floriade beautiful shop in person. Highly recommend. Thankyou!",
    "name": "Joyce M.",
    "wedding": false
  },
  {
    "review": "After admiring Floriade’s Instagram pics for a while, I decided to make an order for Mother’s Day. Annwyn was so friendly accommodating of my special request (I ordered the flowers from overseas and arranged for my brother to collect them). She went out of her way to include the flowers and colour scheme I requested, and left the flowers outside the store for COVID safe, contactless pick up (even though the store was closed and she was no doubt inundated with Mother’s Day requests)! The bouquet is beautiful and I know my mum will love it. Can’t recommend Floriade enough!",
    "name": "Jess B.",
    "wedding": false
  },
  {
    "review": "Highly recommend Floraide. Annwyn arranged our wedding flowers in November. Annwyn also created gorgeous table arrangements for both bridal table, guest tables and weeding cake! It was such a dream! We chose Floriade not only for their amazing flower arrangements, but for Annwyn's exceptional communication, organisation and no task was too big or small. These qualities are so important when planning a wedding. Thank you again Floraide! Xx",
    "name": "Katy H. (Bride)",
    "wedding": true
  },
  {
    "review": "Floriade is an amazing florist in Miramar that is run by the incredible Annwyn.  We needed flowers for our wedding (bouquet, buttonholes, cake and hair flowers).  Annwyn was amazing in the way she listened to our ideas and provided suggestions, as well as getting super excited with our colour choices. The quality of her arrangements were above and beyond our expectations.  Annwyn was friendly and enthusiastic every time we saw her and really added a special spin to our wedding. We definitely recommend Floriade for experience, amazing service, competitive pricing and most of all absolutely gorgeous flowers!",
    "name": "Marina M. (Bride)",
    "wedding": true
  },
  {
    "review": "Annwyn is amazingly talented! She put together beautiful flowers for our wedding day. I've also ordered a number of different bouquets from Floriade and have never been disappointed!",
    "name": "Rebekah S. (Bride)",
    "wedding": true
  },
  {
    "review": "It looks beautiful Annwyn. Thanks so much for your professionalism.",
    "name": "Longe N. New Chapter Cafe",
    "wedding": false
  },
  {
    "review": "Thank you so so much for the beautiful flowers! You did such an amazing job and everything was Perfect! You really make our vision come to life and made our day extra special! You are truly talented.",
    "name": "Katy H.",
    "wedding": false
  },
  {
    "review": "Went in to talk about a bouquet of flowers I wanted to purchase, thinking I might have to order and grab later. They were obviously busy working on a big job but they were able to take the time right there and then to arrange us a bouquet within jut a few minutes. Paired with a lovely conversation I left with a beautiful bouquet and a pleasant experience.",
    "name": "Sarah A.",
    "wedding": false
  },
  {
    "review": "They are so beautiful. I can't say in words how grateful I am. I love them so much. Now my family want Annwyn to do some for their homes! She chose perfect card and handwritten my own words! Everything was amazing. I will always come here now. Worth every penny!",
    "name": "Sarina H.",
    "wedding": false
  },
  {
    "review": "My friend  and I both think you are an artist and a genius and so very, very talented. You blew my friends mind with the gorgeous arrangement you delivered yesterday and she sent me a photo to show how absolutely gorgeous the selection of ‘soft’ colours were - we are both thrilled and will recommend you to anyone who asks for a great florist - and anyone who doesn’t!!  Kindest regards and thank you for making my friend’s birthday memorable.",
    "name": "Lynn G.",
    "wedding": false
  },
  {
    "review": "I found Floriade's website searching for a florist online from Canada. I ordered a bouquet for our daughter's birthday and was very pleased with the selection of flowers that were arranged and the matching card to compliment the bouquet. Delivery was right on time and when I called to ask a few questions I received very kind and thorough to service to ensure I was well staisfied.",
    "name": "Terrie H.",
    "wedding": false
  },
  {
    "review": "Amazing work, we have Floriade flowers in our shop and customers love it. Thanks Annwyn!",
    "name": "Andrew G. Grace Patisserie",
    "wedding": false
  },
  {
    "review": "I wanted to say thanks for the truly beautiful flower arrangement for Winnie's ceremony. They'll be enjoyed for a long long time! And her little flower wreath was a big hit and is now hung on her door :) just perfect!",
    "name": "Amy P.",
    "wedding": false
  },
  {
    "review": "Exceptional service and the bouquet was beautiful. Recipient was not at home at time of delivery, Annwyn phoned to ensure they wouldn't be away for the whole day. If so, she was happy to pick the flowers up and deliver them later in the day.",
    "name": "Evangelia E.",
    "wedding": false
  },
  {
    "review": "Oh my gosh. If you are looking to buy flowers, then listen carefully. Don't look anywhere else. Your search is over. You have found Floriade somehow and you can relax that you can now order flowers and know you will be totally and utterly impressed by what you get, and so will the person you get flowers for. Annwyn is charming, experienced, offers wonderful advice, listens, understands the situation and puts together just the right combination and also takes an interest in why the flowers are being ordered - who for, the reason. Goes the extra mile - that's what I'd say. Yes, goes the extra mile. And once you have had excellent service and amazing flowers, then go and tell everyone you meet. The answer to the question \"Where do I go to order flowers?\" is always \"Floriade of course!\"",
    "name": "David M.",
    "wedding": false
  },
  {
    "review": "I bought flowers for my Quran teacher from Floriade as she was ill and was not mobile. The flowers made her happy - It was a \"beautiful bunch and just the right flowers\" she even forwarded me a photo - wow! such beautiful arrangement - thank you Floriade!",
    "name": "Maya D.",
    "wedding": false
  },
  {
    "review": "Annwyn was fantastic and I would highly recommend her! Excellent service and the flowers were amazing.",
    "name": "Daniel N.",
    "wedding": false
  },
  {
    "review": "Very impressed by the professional service provided by Annwyn. We recently sold our house and Annwyn went above and beyond to ensure that we had fresh flowers to a high standard for our open homes. Highly recommend. We are fortunate to have such a service in Miramar.",
    "name": "Sandra S.",
    "wedding": false
  },
  {
    "review": "Based in Auckland, I ordered a bunch of flowers for a family member who lives in Wellington. This was this first time I've ever been emailed a picture of the bouquet that was delivered - which I thought was awesome as it's super nice to see what you ended up paying for! I couldn't recommend Floriade more! They were fantastic and the ordering online process was super easy!",
    "name": "Shayner R.",
    "wedding": false
  },
  {
    "review": "Amazing floral arrangements. So unique and beautiful, I have loved the two bunches I've ordered and so have the recipients. Amazing service also with delivery confirmation and great photos sent of the arrangement as well. Highly recommend.",
    "name": "Kirsten.",
    "wedding": false
  },
  {
    "review": "I only buy my flowers from Annwyn! She is always so lovely and helpful and I can just give her a colour or a mood and she comes up with the most amazing creations! Miramar is so lucky to have her!",
    "name": "Lesleigh R.",
    "wedding": false
  },
  {
    "review": "Thank you so much for your beautiful flowers for my partner! I was trying to find a nice balance of vibrant colours but with subtle tones for our home.... You got this spot on ... Not once but twice ! Bigger bunch than expecting for amazing price so definitely get your money's worth! And incredible customer service with personalized message included !",
    "name": "Shaun R.",
    "wedding": false
  },
  {
    "review": "Annwyn has a beautiful display in her store, it is an incredibly beautiful place to be and makes it difficult to choose which flowers you want! I love that she has flowers not seen in your average florist or supermarket bunch. Annwyn created a beautiful pastel arrangement and it was absolutely gorgeous. Excellent store, beautiful arrangements and lovely service.",
    "name": "Jess C.",
    "wedding": false
  },
  {
    "review": "Annwyn has a true artist's eye. Her beautiful arrangements are so different from the normal bouquets, and feel lush, luxurious and designer. She listens very carefully to your requirements and budget, then creates something truly breathtaking. The recipient of one bouquet from me cried because it was so lovely. What else could you want! I wholeheartedly recommend.",
    "name": "Sinead B.",
    "wedding": false
  },
  {
    "review": "Thank you so much Annwyn for the beautiful bouquet that you had made for my friends 50th. She loved them so much. Highly recommend!",
    "name": "Jaycee.",
    "wedding": false
  },
  {
    "review": "Picked up a bouquet for a friend and got just what I asked for. If you like elegant and tasteful, then I'd recommend going here!",
    "name": "Lauryn H.",
    "wedding": false
  },
  {
    "review": "Annwyn's arrangements are absolutely stunning and she's always a pleasure to deal with, making sure to know exactly what I'm after whatever the occasion.",
    "name": "Anders L.",
    "wedding": false
  },
  {
    "review": "No wonder she responded by saying \"beautiful, gorgeous, wild and breathtaking\".  Thank you so much for getting that so right. She's delighted. Yes, you do make people happy through flowers.",
    "name": "Lorraine I.",
    "wedding": false
  },
  {
    "review": "Thank you so much Annwyn! The flowers are absolutely stunning and she cried a little bit, which is normally a good sign :)",
    "name": "Anders L.",
    "wedding": false
  },
  {
    "review": "Annwyn has opened and runs the most amazing of flower shops. She has a wonderfully distinct style and my good lady always loves flowers from Floriade! Let's just say it's a win/win/win ;)",
    "name": "Dave K.",
    "wedding": false
  },
  {
    "review": "Floriade is amazing! I went into the shop and was greeted by Annwyn and her daughter Alessandra and they told me a seamless way to order the bouquet I wanted for Mothers day and they arrived perfectly! Beautiful pastel colours! Would order again in a heartbeat!",
    "name": "Miqdad R.",
    "wedding": false
  },
  {
    "review": "Thank you so so so much! Everything was perfect and people were raving about how amazing the flowers were. Honestly, I couldn’t have imagined it looking so beautiful.",
    "name": "Sarah W. (Bride)",
    "wedding": true
  },
  {
    "review": "Floriade flowers is absolutely fantastic! We had Annwyn do our wedding and could not recommend someone more highly. Her professional approach was matched by a delightful enthusiasm and eagerness to make our flowers absolutely perfect. I couldn’t have imagined a more magical layout for our tables, and the bouquets. We had a fairytale magical theme for our wedding and Annwyn went above and beyond to create a truly unique and stunning atmosphere that blew us away. Our guests were enchanted and we received so many compliments. So well priced and absolutely no fuss. Annwyn is a treasure! Thank you so much.",
    "name": "Michelle C. (Bride)",
    "wedding": true
  },
  {
    "review": "Annwyn has a lovely little business in Miramar and she made me an absolutely beautiful bunch of flowers. I'll be back next time I need flowers!",
    "name": "Alarna S.",
    "wedding": false
  },
  {
    "review": "Annwyn provided the most fabulous Christmas floral bouquet in a vase. Just beautiful!",
    "name": "Karen H.",
    "wedding": false
  },
  {
    "review": "We asked for bright, cheery flowers last minute for a friend in need and Floriade did a perfect job! Fantastic customer service and reasonable prices ensures that I'll be coming here every time!",
    "name": "Reina O.",
    "wedding": false
  },
  {
    "review": "Floriade flowers in Wellington are incredible!! Annwyn always does such a beautiful job. She once did flowers for a wedding I was bridesmaid for and they were exquisite, and oh my did the flower choice and arrangement style suit the brides personality! If you are getting married or any special occasion she should be your go to! I also highly recommend if you are living out of Wellington (like me) and want flowers delivered to a special someone…. Incredible service, beautiful flowers, quick and well priced for the quality of the bouquets…",
    "name": "Annie G. (Bridesmaid)",
    "wedding": true
  },
  {
    "review": "I was so pleased with the absolutely lovely bouquet that Annwyn created for my niece, and my niece was just thrilled too. My sisters and I live in Canada and our much loved niece is living in Wellington. Since it was her birthday we wanted to send her flowers. When I looked on line I immediately saw that Floriade Floral and Plant Design creates just the sort of flower designs that we and my niece just love. I phoned and Annwyn assembled and delivered a marvellous bouquet. My niece immediately sent an email (and a photo!) saying how absolutely pleased she was with them. I will order from Annwyn again.",
    "name": "Susanne B.",
    "wedding": false
  },
  {
    "review": "Your flowers were beyond perfect for me and Annie and Garrick too. You probably hear that all the time but seriously they were perfect. Thank you for your swift action in making them also.",
    "name": "Zoe A. (Bride)",
    "wedding": true
  },
  {
    "review": "Thanks for the lovely flowers and the same day delivery. My friend sent me a pic of the bouquet - it was beautiful and they made her day. Thanks for the great service - I will definitely use you guys again and will recommend to others also.",
    "name": "Tina T.",
    "wedding": false
  },
  {
    "review": "Fast service, lovely flowers!",
    "name": "Elspeth G.",
    "wedding": false
  },
  {
    "review": "Loved the flowers, so beautifully sweet and simple.",
    "name": "Zoe A. (Bride)",
    "wedding": false
  },
  {
    "review": "A gem in Miramar as a go-to place for everything about flowers. Annwyn is so lovely and she puts her love into every composition she makes for you.",
    "name": "Paolo S.",
    "wedding": false
  },
  {
    "review": "I received a bunch of flowers from your business as a gift for my birthday on Wednesday. My mother was a florist and I am a gardner and lover of flowers. The bunch was ~ and still is ~ just delightful and giving me great joy. Particularly charming is the combination of foliage and flowers, gorgeous pale pink chrysanthemum, ranunculus and stock all solid keepers in terms of longevity indoors and so pleasing to the eye fleshed out with interesting and mostly flowered foliage. My complements to you on your fine selection and grace in creating such a lovely gift.",
    "name": "Pip M.",
    "wedding": false
  },
  {
    "review": "Everyone said how perfect the flowers were. My kind of bunch.",
    "name": "Zoe A. (Bride)",
    "wedding": true
  },
  {
    "review": "Very lucky to have Floriade join the Miramar Peninsula community! I was after something beautiful but practical to spruce up the table for my husband's birthday breakfast, and Annwyn suggested this heart-shaped ivy topiary. The perfect touch of something different and it looked great surrounded by presents, yummy food & fresh coffee. Best of all, the kids are having so much fun peeking through the heart at us from the other side of the table! Highly recommend Annwyn's friendly, professional service and her selection of gorgeous floral arrangements.",
    "name": "Janet F.",
    "wedding": false
  },
  {
    "review": "Impeccable customer service and stunning bouquets. Would highly recommend!",
    "name": "Mary A.",
    "wedding": false
  },
  {
    "review": "Annwyn produces wonderful displays, they are creative, colourful, enduring and, if you will excuse the pun, a cut above the competition. Floriade provides excellent value and would recommend highly.",
    "name": "David S.",
    "wedding": false
  },
  {
    "review": "Wow! Thanks Annwyn, the flowers are spectacular, my wife loved them. Brought a touch of spring into our home on such a miserable week. I'll be in soon for more.",
    "name": "John C.",
    "wedding": false
  },
  {
    "review": "This is my go to for flowers. After being bored of the same boring bunches at New World I found out about Floriade and I never looked back. We get new flowers delivered in our office every other week and it's always amazing.",
    "name": "Greg S.",
    "wedding": false
  },
  {
    "review": "Such a stunning bouquet of flowers, with the most gorgeous scent!! They've been brightening up my kitchen for weeks - highly recommended!",
    "name": "Lisa N.",
    "wedding": false
  },
  {
    "review": "I ordered some flowers from Floriade Floral and Plant Design for a friend last week to cheer her up following surgery, and not only were the bouquets beautiful, they were also hand-delivered because my friend lived just around the corner! Thank you so much for the great service and helping to make my friend smile.",
    "name": "Beeny A.",
    "wedding": false
  },
  {
    "review": "A dear friend ordered flowers from Floriade for my birthday ~ the most beautiful bunch I have ever seen!!! Thank you so much",
    "name": "Meg L.",
    "wedding": false
  },
  {
    "review": "Thank you for the beautiful flowers Annwyn! They are warming our house with lovely earth tones. Just what we need on a cold winter day. We look forward to stopping by again soon!",
    "name": "Kelsi D.",
    "wedding": false
  },
  {
    "review": "Love our amazing salon flowers! Our clients always comment on them too!",
    "name": "Beth T.",
    "wedding": false
  },
  {
    "review": "Great flowers & service, owner involved the kids in picking bunch for nana ~ she loved them!",
    "name": "Kate L.",
    "wedding": false
  },
  {
    "review": "Gorgeous bouquet and the scent is just exquisite! Don't go anywhere else - go straight to Annwyn at Floriade and order the most beautifully designed bouquet!",
    "name": "Tasmin C.",
    "wedding": false
  },
  {
    "review": "Love my bouquet - such a gorgeous mix of flowers! Thank you Floriade!!",
    "name": "Jane W.",
    "wedding": false
  },
  {
    "review": "Amazing Florist that has some great unique designs, and love the family oriented business.",
    "name": "Jennifer S.",
    "wedding": false
  },
  {
    "review": "My flowers lasted for weeks, huge selection and beautifully presented.",
    "name": "Jacqui G.",
    "wedding": false
  },
  {
    "review": "Flowers and more, can't recommend enough.",
    "name": "Sam H.",
    "wedding": false
  }
]
